# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 0s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_resource_group.rg_dp_prod: Read complete after 0s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 2s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 0s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_resource_group.rg_studio_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_dev: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 2s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_data_collection_rule.k6tests will be updated in-place
  ~ resource "azurerm_monitor_data_collection_rule" "k6tests" {
        id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr"
        name                        = "k6tests-dcr"
        tags                        = {}
        # (6 unchanged attributes hidden)

      ~ data_sources {
          ~ extension {
              ~ extension_json     = jsonencode(
                  ~ {
                      ~ dataCollectionSettings = {
                          ~ namespaces             = [
                                # (4 unchanged elements hidden)
                                "platform",
                              + "portaler",
                            ]
                            # (3 unchanged attributes hidden)
                        }
                    }
                )
                name               = "ContainerInsightsExtension"
                # (3 unchanged attributes hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # helm_release.grafana_k8s_monitoring will be updated in-place
  ~ resource "helm_release" "grafana_k8s_monitoring" {
      ~ id                         = "k8s-monitoring" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "3.6.0" -> (known after apply)
          ~ chart          = "k8s-monitoring" -> (known after apply)
          ~ first_deployed = 1753948983 -> (known after apply)
          ~ last_deployed  = 1763737759 -> (known after apply)
          ~ name           = "k8s-monitoring" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                Grafana k8s-monitoring Helm chart deployed!
                
                This chart will install the following components:
                * Grafana Alloy Operator
                * Grafana Alloy "alloy-logs" (daemonset)
                
                It will:
                * Gather Kubernetes Cluster events from the namespaces authentication,core,correspondence,dialogporten,platform and send data to loki.
                * Gather logs from Kubernetes Pods and send data to loki.
                
                Thanks for trying out the alloy-operator!
            EOT -> (known after apply)
          ~ revision       = 11 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alloy-logs      = {
                      - alloy      = {
                          - clustering = {
                              - enabled = true
                            }
                          - mounts     = {
                              - dockercontainers = false
                              - varlog           = false
                            }
                        }
                      - controller = {
                          - podAnnotations = {
                              - "kubernetes.azure.com/set-kube-service-host-fqdn" = "true"
                            }
                        }
                      - enabled    = true
                    }
                  - alloy-metrics   = {
                      - enabled = false
                    }
                  - alloy-profiles  = {
                      - enabled = false
                    }
                  - alloy-receiver  = {
                      - enabled = false
                    }
                  - alloy-singleton = {
                      - enabled = false
                    }
                  - cluster         = {
                      - name = "k6tests-cluster"
                    }
                  - clusterEvents   = {
                      - collector  = "alloy-logs"
                      - enabled    = true
                      - namespaces = [
                          - "authentication",
                          - "core",
                          - "correspondence",
                          - "dialogporten",
                          - "platform",
                        ]
                    }
                  - destinations    = [
                      - {
                          - auth   = {
                              - passwordKey = "password"
                              - type        = "basic"
                              - usernameKey = "username"
                            }
                          - name   = "loki"
                          - secret = {
                              - create    = false
                              - name      = "canary-basic-auth"
                              - namespace = "monitoring"
                            }
                          - type   = "loki"
                          - url    = "http://loki-loki-distributed-gateway.monitoring.svc.cluster.local/loki/api/v1/push"
                        },
                    ]
                  - nodeLogs        = {
                      - enabled = false
                    }
                  - podLogs         = {
                      - collector    = "alloy-logs"
                      - enabled      = true
                      - gatherMethod = "kubernetesApi"
                      - labels       = {
                          - app_kubernetes_io_name = "app.kubernetes.io/name"
                          - test_name              = "test_name"
                          - testid                 = "testid"
                        }
                      - labelsToKeep = [
                          - "app.kubernetes.io/name",
                          - "container",
                          - "instance",
                          - "job",
                          - "level",
                          - "namespace",
                          - "service.name",
                          - "service.namespace",
                          - "deployment.environment",
                          - "deployment.environment.name",
                          - "k8s.namespace.name",
                          - "k8s.deployment.name",
                          - "k8s.statefulset.name",
                          - "k8s.daemonset.name",
                          - "k8s.cronjob.name",
                          - "k8s.job.name",
                          - "k8s.node.name",
                          - "testid",
                          - "test_name",
                        ]
                      - namespaces   = [
                          - "authentication",
                          - "core",
                          - "correspondence",
                          - "dialogporten",
                          - "platform",
                        ]
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.6.0" -> (known after apply)
        } -> (known after apply)
        name                       = "k8s-monitoring"
      ~ values                     = [
          ~ <<-EOT
                # https://github.com/grafana/k8s-monitoring-helm/blob/main/charts/k8s-monitoring/README.md
                ---
                cluster:
                  name: "k6tests-cluster"
                
                destinations:
                  - name: loki
                    type: loki
                    url: http://loki-loki-distributed-gateway.monitoring.svc.cluster.local/loki/api/v1/push
                    auth:
                      type: basic
                      usernameKey: username
                      passwordKey: password
                    secret:
                      create: false
                      name: canary-basic-auth
                      namespace: monitoring
                
                clusterEvents:
                  enabled: true
                  collector: alloy-logs
              -   namespaces: ["authentication","core","correspondence","dialogporten","platform"]
              +   namespaces: ["authentication","core","correspondence","dialogporten","platform","portaler"]
                
                nodeLogs:
                  enabled: false
                
                podLogs:
                  enabled: true
                  gatherMethod: kubernetesApi
                  collector: alloy-logs
              -   namespaces: ["authentication","core","correspondence","dialogporten","platform"]
              +   namespaces: ["authentication","core","correspondence","dialogporten","platform","portaler"]
                  labels:
                    app_kubernetes_io_name: app.kubernetes.io/name
                    testid: testid
                    test_name: test_name
                  labelsToKeep:
                    - app.kubernetes.io/name
                    - container
                    - instance
                    - job
                    - level
                    - namespace
                    - service.name
                    - service.namespace
                    - deployment.environment
                    - deployment.environment.name
                    - k8s.namespace.name
                    - k8s.deployment.name
                    - k8s.statefulset.name
                    - k8s.daemonset.name
                    - k8s.cronjob.name
                    - k8s.job.name
                    - k8s.node.name
                    # custom
                    - testid
                    - test_name
                
                # Collectors
                alloy-singleton:
                  enabled: false
                
                alloy-metrics:
                  enabled: false
                
                alloy-logs:
                  enabled: true
                  # Required when using the Kubernetes API to pod logs
                  alloy:
                    mounts:
                      varlog: false
                      dockercontainers: false
                
                    clustering:
                      enabled: true
                
                  controller:
                    podAnnotations:
                      "kubernetes.azure.com/set-kube-service-host-fqdn": "true"
                
                alloy-profiles:
                  enabled: false
                
                alloy-receiver:
                  enabled: false
            EOT,
        ]
        # (29 unchanged attributes hidden)
    }

  # kubernetes_config_map_v1.deploy_environment_at22["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://at22.altinn.cloud"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.at22.altinn.cloud"
          + "BASE_URL"            = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"          = "at22"
          + "ENV_TYPE"            = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.deploy_environment_at23["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://at23.altinn.cloud"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.at23.altinn.cloud"
          + "BASE_URL"            = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"          = "at23"
          + "ENV_TYPE"            = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.deploy_environment_at24["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://at24.altinn.cloud"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.at24.altinn.cloud"
          + "BASE_URL"            = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"          = "at24"
          + "ENV_TYPE"            = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.deploy_environment_prod["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://altinn.no"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.altinn.no"
          + "BASE_URL"            = "https://platform.altinn.no"
          + "DEPLOY_ENV"          = "prod"
          + "ENV_TYPE"            = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.deploy_environment_tt02["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://tt02.altinn.no"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.tt02.altinn.no"
          + "BASE_URL"            = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"          = "tt02"
          + "ENV_TYPE"            = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map_v1.deploy_environment_yt01["portaler"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL"    = "https://yt01.ai.basefarm.net"
          + "ALTINN_CDN_BASE_URL" = "https://altinncdn.no"
          + "AM_UI_BASE_URL"      = "https://am.ui.yt01.altinn.cloud"
          + "BASE_URL"            = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"          = "yt01"
          + "ENV_TYPE"            = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.namespace["portaler"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_role_binding_v1.dev_access["portaler"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "01505bd1-7216-419d-ae24-bdad763d7e06"
          + namespace = "portaler"
        }
    }

  # kubernetes_role_binding_v1.sp_access["portaler"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "portaler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "3b2529e7-8fa6-48d8-a4ce-eb4683d79c0c"
          + namespace = "portaler"
        }
    }

Plan: 9 to add, 2 to change, 0 to destroy.

Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `push` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan` |